name: "clip"
platform: "pytorch_libtorch"
max_batch_size: 0
input [
{
    name: "INPUT__0"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
    
},
{
    name: "INPUT__1"
    data_type: TYPE_INT32
    dims: [ -1, 77 ]

}
]
output[
{
    name: "OUTPUT__0"
    data_type: TYPE_FP16
    dims: [ 1, -1 ]
},
{
    name: "OUTPUT__1"
    data_type: TYPE_FP16
    dims: [ -1, 1 ]
}
]
