name: "ensemble"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ 1, -1 ]
  },
  {
    name: "INPUT_1"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP16
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT_0"
      }
      input_map {
        key: "INPUT_1"
        value: "INPUT_1"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
      output_map {
        key: "OUTPUT_1"
        value: "tokenized_strings"
      }
    },
    {
      model_name: "clip"
      model_version: 2
      input_map {
        key: "INPUT__0"
        value: "preprocessed_image"
      }
      input_map {
        key: "INPUT__1"
        value: "tokenized_strings"
      }
      output_map {
        key: "OUTPUT__0"
        value: "logits_per_image"
      }
      output_map {
        key: "OUTPUT__1"
        value: "logits_per_text"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "logits_per_image"
      }
      input_map {
        key: "INPUT_1"
        value: "logits_per_text"
      }
      output_map {
        key: "OUTPUT_0"
        value: "OUTPUT"
      }
    }
  ]
}
