name: "preprocess"
backend: "python"
max_batch_size: 0 
input [
{
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ 1, -1 ]
},
{
    name: "INPUT_1"
    data_type: TYPE_STRING
    dims: [ -1 ]
}
]
 
output [
{
    name: "OUTPUT_0"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
},
{
    name: "OUTPUT_1"
    data_type: TYPE_INT32
    dims: [ -1, 77 ]
    label_filename: "labels.txt"
}
]

instance_group [{ kind: KIND_CPU }]
